Documents/LM_СписаниеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>LM_СписаниеОстатков</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LM_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.LM_Касса</xr:Item>
				<xr:Item>AccumulationRegister.LM_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Педагог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ГруппыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДисконтныеКарты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДенег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЗСписаниеКасса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.LM_ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/LM_СписаниеОстатков/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.LM_СписаниеОстатков.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеОстатков.АвторДокумента КАК АвторДокумента,
	|	СписаниеОстатков.Дата КАК Дата,
	|	СписаниеОстатков.КоличествоЧасов КАК КоличествоЧасов,
	|	СписаниеОстатков.Комментарий КАК Комментарий,
	|	СписаниеОстатков.Номер КАК Номер,
	|	СписаниеОстатков.Сумма КАК Сумма,
	|	СписаниеОстатков.СуммаБонусов КАК СуммаБонусов,
	|	СписаниеОстатков.ТЗСписания.(
	|		НомерСтроки КАК НомерСтроки,
	|		Ученик КАК Ученик,
	|		Педагог КАК Педагог,
	|		Тариф КАК Тариф,
	|		КоличествоЧасов КАК КоличествоЧасов,
	|		Сумма КАК Сумма,
	|		ГруппаОбучения КАК ГруппаОбучения,
	|		ПредметОбучения КАК ПредметОбучения
	|	) КАК ТЗСписания,
	|	СписаниеОстатков.ДисконтныеКарты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДисконтнаяКарта.Владелец КАК Ученик,
	|		ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		СуммаБонусов КАК СуммаБонусов,
	|		ДисконтнаяКарта.ДатаОкончанияДействия КАК ДатаСписания
	|	) КАК ДисконтныеКарты,
	|	СписаниеОстатков.ТЗСписаниеКасса.(
	|		НомерСтроки КАК НомерСтроки,
	|		Ученик КАК Ученик,
	|		СтатьяЗатрат КАК СтатьяЗатрат,
	|		Касса КАК Касса,
	|		ПредметОбучения КАК ПредметОбучения,
	|		ВидОперации КАК ВидОперации,
	|		Сумма КАК Сумма
	|	) КАК ТЗСписаниеКасса,
	|	СписаниеОстатков.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.LM_СписаниеОстатков КАК СписаниеОстатков
	|ГДЕ
	|	СписаниеОстатков.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЗСписанияШапка = Макет.ПолучитьОбласть("ТЗСписанияШапка");
	ОбластьТЗСписания = Макет.ПолучитьОбласть("ТЗСписания");
	ОбластьДисконтныеКартыШапка = Макет.ПолучитьОбласть("ДисконтныеКартыШапка");
	ОбластьДисконтныеКарты = Макет.ПолучитьОбласть("ДисконтныеКарты");
	ОбластьТЗСписаниеКассаШапка = Макет.ПолучитьОбласть("ТЗСписаниеКассаШапка");
	ОбластьТЗСписаниеКасса = Макет.ПолучитьОбласть("ТЗСписаниеКасса");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Если Выборка.Ссылка.ТЗСписания.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьТЗСписанияШапка);
		ВыборкаТЗСписания = Выборка.ТЗСписания.Выбрать();
		Пока ВыборкаТЗСписания.Следующий() Цикл
			ОбластьТЗСписания.Параметры.Заполнить(ВыборкаТЗСписания);
			ТабДок.Вывести(ОбластьТЗСписания, ВыборкаТЗСписания.Уровень());
		КонецЦикла;
		КонецЕсли;

		Если Выборка.Ссылка.ДисконтныеКарты.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьДисконтныеКартыШапка);
		ВыборкаДисконтныеКарты = Выборка.ДисконтныеКарты.Выбрать();
		Пока ВыборкаДисконтныеКарты.Следующий() Цикл
			ОбластьДисконтныеКарты.Параметры.Заполнить(ВыборкаДисконтныеКарты);
			ТабДок.Вывести(ОбластьДисконтныеКарты, ВыборкаДисконтныеКарты.Уровень());
		КонецЦикла;
		КонецЕсли;

		Если Выборка.Ссылка.ТЗСписаниеКасса.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьТЗСписаниеКассаШапка);
		ВыборкаТЗСписаниеКасса = Выборка.ТЗСписаниеКасса.Выбрать();
		Пока ВыборкаТЗСписаниеКасса.Следующий() Цикл
			ОбластьТЗСписаниеКасса.Параметры.Заполнить(ВыборкаТЗСписаниеКасса);
			ТабДок.Вывести(ОбластьТЗСписаниеКасса, ВыборкаТЗСписаниеКасса.Уровень());
		КонецЦикла;
		КонецЕсли;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
